docs/assign07.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-07-07 Wed 14:19 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>SWE 619 Assignment 7</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="ThanhVu (Vu) Nguyen" />
<link rel="stylesheet" href="https://nguyenthanhvuh.github.io/files/org.css">
</head>
<body>
<div id="content">
<h1 class="title">SWE 619 Assignment 7</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org2b09fe1">1. Goals: Goal: Polymorphic Abstraction.</a></li>
<li><a href="#org3779777">2. Grading Criteria</a></li>
<li><a href="#org273c9a9">3. Links</a></li>
</ul>
</div>
</div>

<div id="outline-container-org2b09fe1" class="outline-2">
<h2 id="org2b09fe1"><span class="section-number-2">1</span> Goals: Goal: Polymorphic Abstraction.</h2>
<div class="outline-text-2" id="text-1">
<p>
A <code>Comparator</code> based on absolute values is problematic. Code up the comparator and then write client code that illustrates the problem. Use a <i>lambda function</i> to implement the comparator. Explain what is wrong in a brief summary statement. Your explanation of the problem must be phrased in terms of a violation of the contract for <code>Comparator</code>.
</p>

<p>
To emphasize that this contract problem is real, your code should create two Java sets, one a <code>HashSet</code>, and the other a <code>TreeSet</code>. The <code>TreeSet</code> should order items with your absolute value comparator. Your example should add the same integers to both sets, yet still end up with sets that are different. Your summary statement should explain why.
</p>
</div>
</div>

<div id="outline-container-org3779777" class="outline-2">
<h2 id="org3779777"><span class="section-number-2">2</span> Grading Criteria</h2>
<div class="outline-text-2" id="text-2">
<p>
As for other recent assignments, your deliverable is a clear, concise story that demonstrates completion of the assignment.
</p>
</div>
</div>



<div id="outline-container-org273c9a9" class="outline-2">
<h2 id="org273c9a9"><span class="section-number-2">3</span> Links</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li><a href="./index.html">Syllabus</a></li>
<li><a href="./schedule.html">Schedule</a></li>
</ul>
</div>
</div>
</div>
</body>
</html>
